rolando042001/Agritech/5_2_ESP32Cam_WIFI_Web/app_httpd.cpp
        <h3 style="text-align:center;margin-top:20px;">Camera & Actuator Control</h3>

        <div class="cont_flex">  
            <div style="display: flex;align-items: center;">Pan <input type="range" id="pan" min="0" max="180" value="90" onchange="try{fetch(document.location.origin+'/control?var=pan&val='+this.value);}catch(e){}"></div>
        </div>
        

        <div class="cont_flex">  
            <div style="display: flex;align-items: center;">Tilt <input type="range" id="tilt" min="30" max="180" value="90" onchange="try{fetch(document.location.origin+'/control?var=tilt&val='+this.value);}catch(e){}"></div>
        </div>

         <div class="cont_flex">  
            <div style="display: flex;align-items: center;">dolly <input type="range" id="dolly" min="30" max="180" value="90" onchange="try{fetch(document.location.origin+'/control?var=dolly&val='+this.value);}catch(e){}"></div>
        </div>

        <!-- ====== DOLLY CONTROL ====== -->
        <h3 style="text-align:center;margin-top:20px;">Dolly Control</h3>
        <div class="cont_flex">
            <button onclick="fetch('/control?var=dolly&val=0')"
                style="width:100px;height:40px;">Left</button>

            <button onclick="fetch('/control?var=dolly&val=90')"
                style="width:100px;height:40px;">Center</button>

            <button onclick="fetch('/control?var=dolly&val=180')"
                style="width:100px;height:40px;">Right</button>
        </div>

        <!-- ====== BLOWER FAN CONTROL ====== -->
        <h3 style="text-align:center;margin-top:20px;">Blower Fan</h3>
        <div class="cont_flex_threebuttom">
            <button onclick="toggleBlower(1)">BLOWER ON</button>
                style="width:120px;height:40px;background:#44c767;">Turn ON</button>

            <button onclick="toggleBlower(0)">BLOWER OFF</button>
                style="width:120px;height:40px;background:#e94a4a;">Turn OFF</button>
        </div>



        <!-- ACTUATOR -->
        <div class="cont_flex">  
            <div style="display:flex;align-items:center;">
                ACTUATOR
                <button onclick="toggleActuator(1)">DEPLOY</button>
                <button onclick="toggleActuator(2)">RETRACT</button>
            </div>
        </div>


        
        <div class="cont_flex">  
            <div style="display: flex;align-items: center;">Speed <input type="range" id="speed" min="150" max="255" value="220" onchange="try{fetch(document.location.origin+'/control?var=speed&val='+this.value);}catch(e){}"></div>
        </div>
        <div class="cont_flex">  
            <div style="display: flex;align-items: center;">L E D <input type="range" id="flash" min="0" max="255" value="0" onchange="try{fetch(document.location.origin+'/control?var=flash&val='+this.value);}catch(e){}"></div>
        </div>
        <!--
        <div class="cont_flex">  
            <div style="display: flex;align-items: center;">Qual. <input type="range" id="quality" min="10" max="63" value="10" onchange="try{fetch(document.location.origin+'/control?var=quality&val='+this.value);}catch(e){}"></div>
        </div>
        <div class="cont_flex">  
            <div style="display: flex;align-items: center;">Frame <input type="range" id="framesize" min="0" max="5" value="5" onchange="try{fetch(document.location.origin+'/control?var=framesize&val='+this.value);}catch(e){}"></div>
        </div>
        -->

        <script>
            window.onload = function(){
                var canvas = document.getElementById("canvas");
                var ctx = canvas.getContext("2d");

                ctx.fillStyle = "rgb(255,0,0)";
                ctx.fillRect(73,25,60,35);
                ctx.clearRect(78,30,50,25);

                ctx.fillRect(93,20,20,5);
                ctx.fillRect(68,35,5,15);
                ctx.fillRect(133,35,5,15);

                ctx.beginPath();
                ctx.arc(92,42,6,0,2*Math.PI,true);
                ctx.fill();

                ctx.beginPath();
                ctx.arc(117,42,6,0,2*Math.PI,true);
                ctx.fill();

                ctx.beginPath();
                ctx.arc(104,100,35,0,Math.PI,true);
                ctx.fill();

                ctx.clearRect(50,85,100,20);

                let actuatorState = 0; // 0=stop, 1=deploy, 2=retract

let actuatorState = 0;
let blowerState = 0;

function toggleActuator(command){
    if(actuatorState===command){ actuatorState=0; fetch(`/control?var=actuator&val=0`); console.log("Actuator STOP"); return;}
    if(blowerState===1){ blowerState=0; fetch(`/control?var=blower&val=0`); console.log("Blower OFF due to actuator");}
    actuatorState=command;
    fetch(`/control?var=actuator&val=${command}`);
}

function toggleBlower(command){
    if(blowerState===command){ blowerState=0; fetch(`/control?var=blower&val=0`); console.log("Blower STOP"); return;}
    if(actuatorState!==0){ actuatorState=0; fetch(`/control?var=actuator&val=0`); console.log("Actuator STOP due to blower");}
    blowerState=command;
    fetch(`/control?var=blower&val=${command}`);
}

// PAN & TILT SLIDERS
function setPan(val){
    fetch(`/control?var=pan&val=${val}`);
}

function setTilt(val){
    fetch(`/control?var=tilt&val=${val}`);
}

            }
        
            document.addEventListener(
            'DOMContentLoaded',function(){
                function b(B){let C;switch(B.type){case'checkbox':C=B.checked?1:0;break;case'range':case'select-one':C=B.value;break;case'button':case'submit':C='1';break;default:return;}const D=`${c}/control?var=${B.id}&val=${C}`;fetch(D).then(E=>{console.log(`request to ${D} finished, status: ${E.status}`)})}var c=document.location.origin;const e=B=>{B.classList.add('hidden')},f=B=>{B.classList.remove('hidden')},g=B=>{B.classList.add('disabled'),B.disabled=!0},h=B=>{B.classList.remove('disabled'),B.disabled=!1},i=(B,C,D)=>{D=!(null!=D)||D;let E;'checkbox'===B.type?(E=B.checked,C=!!C,B.checked=C):(E=B.value,B.value=C),D&&E!==C?b(B):!D&&('aec'===B.id?C?e(v):f(v):'agc'===B.id?C?(f(t),e(s)):(e(t),f(s)):'awb_gain'===B.id?C?f(x):e(x):'face_recognize'===B.id&&(C?h(n):g(n)))};document.querySelectorAll('.close').forEach(B=>{B.onclick=()=>{e(B.parentNode)}}),fetch(`${c}/status`).then(function(B){return B.json()}).then(function(B){document.querySelectorAll('.default-action').forEach(C=>{i(C,B[C.id],!1)})});const j=document.getElementById('stream'),k=document.getElementById('stream-container'),l=document.getElementById('get-still'),m=document.getElementById('toggle-stream'),n=document.getElementById('face_enroll'),o=document.getElementById('close-stream'),p=()=>{window.stop(),m.innerHTML='Start Screen'},q=()=>{j.src=`${c+':81'}/stream`,f(k),m.innerHTML='Stop Stream'};l.onclick=()=>{p(),j.src=`${c}/capture?_cb=${Date.now()}`,f(k)},o.onclick=()=>{p(),e(k)},m.onclick=()=>{const B='Stop Stream'===m.innerHTML;B?p():q()},n.onclick=()=>{b(n)},document.querySelectorAll('.default-action').forEach(B=>{B.onchange=()=>b(B)});const r=document.getElementById('agc'),s=document.getElementById('agc_gain-group'),t=document.getElementById('gainceiling-group');r.onchange=()=>{b(r),r.checked?(f(t),e(s)):(e(t),f(s))};const u=document.getElementById('aec'),v=document.getElementById('aec_value-group');u.onchange=()=>{b(u),u.checked?e(v):f(v)};const w=document.getElementById('awb_gain'),x=document.getElementById('wb_mode-group');w.onchange=()=>{b(w),w.checked?f(x):e(x)};const y=document.getElementById('face_detect'),z=document.getElementById('face_recognize'),A=document.getElementById('framesize');A.onchange=()=>{b(A),5<A.value&&(i(y,!1),i(z,!1))},y.onchange=()=>{return 5<A.value?(alert('Please select CIF or lower resolution before enabling this feature!'),void i(y,!1)):void(b(y),!y.checked&&(g(n),i(z,!1)))},z.onchange=()=>{return 5<A.value?(alert('Please select CIF or lower resolution before enabling this feature!'),void i(z,!1)):void(b(z),z.checked?(h(n),i(y,!0)):g(n))}});
        
        </script>
    </body>
</html>
)rawliteral";

static esp_err_t index_handler(httpd_req_t *req){
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

void startCameraServer()
{
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    
    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t status_uri = {
        .uri       = "/status",
        .method    = HTTP_GET,
        .handler   = status_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t cmd_uri = {
        .uri       = "/control",
        .method    = HTTP_GET,
        .handler   = cmd_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t capture_uri = {
        .uri       = "/capture",
        .method    = HTTP_GET,
        .handler   = capture_handler,
        .user_ctx  = NULL
    };

   httpd_uri_t stream_uri = {
        .uri       = "/stream",
        .method    = HTTP_GET,
        .handler   = stream_handler,
        .user_ctx  = NULL
    };
    
    Serial.printf("Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}
